# Welcome to Jupyter

In [ ]:
print ("welcome to jupyter")

# Let's Import Some libraries

In [1]:
import pandas as pd
import numpy as np

# Series

In [ ]:
# Series-- 1-d array object which contains sequence of value and an associated array of data labels called index

In [2]:
ser = pd.Series(['a','b','c','d'])
ser

0    a
1    b
2    c
3    d
dtype: object

In [3]:
#series with predefined index
ser1 = pd.Series([8,4,6,9], index= ['a','b','c','d'])
ser1

a    8
b    4
c    6
d    9
dtype: int64

In [4]:
# selection of values with the help of index

In [5]:
ser1['a']

8

In [6]:
ser1[['a','d']]

a    8
d    9
dtype: int64

In [9]:
# filtering with boolean array


ser1[ser1>7]

a    8
d    9
dtype: int64

In [10]:
ser1[ser1<=8]

a    8
b    4
c    6
dtype: int64

In [11]:
# Scalar Multiplication


ser1*2

a    16
b     8
c    12
d    18
dtype: int64

In [12]:
# Mathematical Function implication on series


np.exp(ser1)

a    2980.957987
b      54.598150
c     403.428793
d    8103.083928
dtype: float64

In [13]:
np.log(ser1)

a    2.079442
b    1.386294
c    1.791759
d    2.197225
dtype: float64

In [15]:
# value check with the help of in operator

'd' in ser1

False

In [17]:
3 in ser   # as this series has numeric index value

False

In [ ]:
# Creating Series with Dictionary

In [18]:
data = {"Name": 'Raj', 'key2': 20}

In [19]:
ser2 = pd.Series(data)

ser2

Name    Raj
key2     20
dtype: object

In [ ]:
# overwriting of index in existing series

In [22]:
student=['Name','Age','Qual']   # one or more values should be identical

ser2= pd.Series(data, index=student)

ser2

Name    Raj
Age     NaN
Qual    NaN
dtype: object

In [23]:
# isnull() and notnull()

pd.isnull(ser2)

Name    False
Age      True
Qual     True
dtype: bool

In [24]:
pd.notnull(ser2)

Name     True
Age     False
Qual    False
dtype: bool

In [ ]:
# arithmatic operation

In [25]:
sdata = {'Hyd': 35000, 'Tel': 71000, 'Bih': 16000, 'Up': 5000}

In [26]:
obj = pd.Series(sdata)
obj

Hyd    35000
Tel    71000
Bih    16000
Up      5000
dtype: int64

In [27]:
states = ['WB', 'Hyd', 'Blore', 'Tel']
obj1 = pd.Series(sdata, index=states)
print(obj1)

WB           NaN
Hyd      35000.0
Blore        NaN
Tel      71000.0
dtype: float64

In [28]:
obj+obj1

Bih           NaN
Blore         NaN
Hyd       70000.0
Tel      142000.0
Up            NaN
WB            NaN
dtype: float64

In [29]:
# assigning name to series

obj1.name= 'state_pop'
obj1

WB           NaN
Hyd      35000.0
Blore        NaN
Tel      71000.0
Name: state_pop, dtype: float64

In [30]:
# assigning name to index

obj1.index.name = 'States'
obj1

States
WB           NaN
Hyd      35000.0
Blore        NaN
Tel      71000.0
Name: state_pop, dtype: float64

In [31]:
# index alteration by assignment

obj1.index = ['Bihar','Punjab','UP','MP']

obj1

Bihar         NaN
Punjab    35000.0
UP            NaN
MP        71000.0
Name: state_pop, dtype: float64

In [33]:
# Droping entries from axis in Series

obj2= pd.Series(np.arange(6), index=list('abcdef'))
obj2

a    0
b    1
c    2
d    3
e    4
f    5
dtype: int32

In [34]:
new_obj = obj2.drop('b')
new_obj

a    0
c    2
d    3
e    4
f    5
dtype: int32

In [36]:
obj2.drop(['d','f'])

a    0
b    1
c    2
e    4
dtype: int32

In [37]:
obj2

a    0
b    1
c    2
d    3
e    4
f    5
dtype: int32

In [38]:
# Indexing, Slicing and Filtering with Series

obj2['e']  #indexing

4

In [39]:
obj2[2:4]  # Slicing

c    2
d    3
dtype: int32

In [40]:
obj2[['b','e']]   #indexing

b    1
e    4
dtype: int32

In [41]:
obj2[[1,3]]     #indexing

b    1
d    3
dtype: int32

In [42]:
obj2['b':'e']   # Slicing with labels

b    1
c    2
d    3
e    4
dtype: int32

In [43]:
obj2[obj2<3]   #  Filtering

a    0
b    1
c    2
dtype: int32

In [45]:
# modifying values
obj2['b':'c'] = 5
obj2

a    0
b    5
c    5
d    3
e    4
f    5
dtype: int32

In [1]:
# Dataframe -- a group of series, where each series contains a column of data

In [2]:
# Dataframe friom dictionary

In [4]:
data = {'name':['Raj','Mohan','Ramesh','Pinky'],
         'age':[20,21,25,19],
          'qual':['Grad','Engg','BSc','Bcom']}

In [5]:
df = pd.DataFrame(data)

df

     name  age  qual
0     Raj   20  Grad
1   Mohan   21  Engg
2  Ramesh   25   BSc
3   Pinky   19  Bcom

In [6]:
# manipulation over column position


df=pd.DataFrame(data, columns=['age','name','qual'])

df

   age    name  qual
0   20     Raj  Grad
1   21   Mohan  Engg
2   25  Ramesh   BSc
3   19   Pinky  Bcom

In [ ]:
# if you pass column name more than the value in dictionry

In [7]:
df2 = pd.DataFrame(data, columns=['name','age','qual','married'])

df2

     name  age  qual married
0     Raj   20  Grad     NaN
1   Mohan   21  Engg     NaN
2  Ramesh   25   BSc     NaN
3   Pinky   19  Bcom     NaN

In [8]:
# to check columns in dataframe

df2.columns

Index(['name', 'age', 'qual', 'married'], dtype='object')

In [9]:
# to retrive column attribute

df2[['age','name'] ]   #index method

   age    name
0   20     Raj
1   21   Mohan
2   25  Ramesh
3   19   Pinky

In [10]:
df2.age   # direct method

0    20
1    21
2    25
3    19
Name: age, dtype: int64

In [11]:
# based on label i.e loc

df2.loc[1]  #index value is provided here

name       Mohan
age           21
qual        Engg
married      NaN
Name: 1, dtype: object

In [15]:
df2.loc[:,['age','name']]  # all rows along with age and name column

   age    name
0   20     Raj
1   21   Mohan
2   25  Ramesh
3   19   Pinky

In [16]:
df2.loc[:,'age']

0    20
1    21
2    25
3    19
Name: age, dtype: int64

In [17]:
df2.loc[[1,3],'age']

1    21
3    19
Name: age, dtype: int64

In [18]:
df.loc[[1,3],['age','name']]

   age   name
1   21  Mohan
3   19  Pinky

In [19]:
# based on position i.e iloc

df2.iloc[0:2,1:3]

   age  qual
0   20  Grad
1   21  Engg

In [20]:
df2.iloc[:,[1,3]]

   age married
0   20     NaN
1   21     NaN
2   25     NaN
3   19     NaN

In [21]:
df2.iloc[[1,3],:]

    name  age  qual married
1  Mohan   21  Engg     NaN
3  Pinky   19  Bcom     NaN

In [22]:
df2.iloc[[0,2],[0,3]]

     name married
0     Raj     NaN
2  Ramesh     NaN

In [23]:
# column modification with assignment
#val=input("enter the val for married")
df2['married'] = 'NO'

df2

     name  age  qual married
0     Raj   20  Grad      NO
1   Mohan   21  Engg      NO
2  Ramesh   25   BSc      NO
3   Pinky   19  Bcom      NO

In [24]:
df2['income']= np.NaN     

df2

     name  age  qual married  income
0     Raj   20  Grad      NO     NaN
1   Mohan   21  Engg      NO     NaN
2  Ramesh   25   BSc      NO     NaN
3   Pinky   19  Bcom      NO     NaN

In [25]:
df2['profession']=['Intern','Student','Student','Intern']

df2

     name  age  qual married  income profession
0     Raj   20  Grad      NO     NaN     Intern
1   Mohan   21  Engg      NO     NaN    Student
2  Ramesh   25   BSc      NO     NaN    Student
3   Pinky   19  Bcom      NO     NaN     Intern

In [26]:
# deletion of column from dataframe

del df2['income']

df2

     name  age  qual married profession
0     Raj   20  Grad      NO     Intern
1   Mohan   21  Engg      NO    Student
2  Ramesh   25   BSc      NO    Student
3   Pinky   19  Bcom      NO     Intern

In [27]:
# Dictionary Creation with nested Dictionary

data = {'Pune':{2001:4, 2002:9},
         'Hyd':{2000:5,2001:5,2002:3}}

df3 = pd.DataFrame(data)   #outer key-- column  #inner key--index

df3

      Pune  Hyd
2001   4.0    5
2002   9.0    3
2000   NaN    5

In [28]:
# Transpose

df3.T

      2001  2002  2000
Pune   4.0   9.0   NaN
Hyd    5.0   3.0   5.0

In [29]:
# Index name
df3.index.name = 'Year'

df3

      Pune  Hyd
Year
2001   4.0    5
2002   9.0    3
2000   NaN    5

In [30]:
# Column Name
df3.columns.name = 'City'

In [31]:
df3

City  Pune  Hyd
Year
2001   4.0    5
2002   9.0    3
2000   NaN    5

In [32]:
df3.columns

Index(['Pune', 'Hyd'], dtype='object', name='City')

In [33]:
# to check  values

df3.values

array([[ 4.,  5.],
       [ 9.,  3.],
       [nan,  5.]])

In [34]:
df3['Pune'].unique

<bound method Series.unique of Year
2001    4.0
2002    9.0
2000    NaN
Name: Pune, dtype: float64>

In [35]:
df3['Hyd'].unique()

array([5, 3], dtype=int64)

In [ ]:
# Reindexing-- create a new object with the data conformed(adoption) to a new index

In [36]:
# Reindexing with Series

a = pd.Series([1,2,3,4], index= list('abcd'))

a_rindex = a.reindex(list('acdeb'))

a

a    1
b    2
c    3
d    4
dtype: int64

In [37]:
a_rindex

a    1.0
c    3.0
d    4.0
e    NaN
b    2.0
dtype: float64

In [ ]:
 #for ordered data, like time series, we can do interpolation i.e filling of values when reindeing.
 #we can do this by method -- ffill and bfill

In [38]:
colour = pd.Series(['red','blue','green'], index=[0,2,4])

colour1 = pd.Series(['red','blue','green'], index=[0,2,4])

In [39]:
colour

0      red
2     blue
4    green
dtype: object

In [ ]:
# ffill

In [40]:
colour = colour.reindex(range(6),method='ffill')

In [41]:
colour

0      red
1      red
2     blue
3     blue
4    green
5    green
dtype: object

In [42]:
colour1 = colour1.reindex(range(6), method='bfill')

In [43]:
colour1

0      red
1     blue
2     blue
3    green
4    green
5      NaN
dtype: object

In [ ]:
# Reindexing with DataFrame

# in dataframe reindexing can alter either index or column or both

In [44]:
df = pd.DataFrame(np.arange(9).reshape(3,3), index= list('acb'), columns= ['Hyd','Pune','Blore'])
df

   Hyd  Pune  Blore
a    0     1      2
c    3     4      5
b    6     7      8

In [45]:
df1= df.reindex(list('abdc'))  # when only one sequence is pass it reindex the row/index

In [46]:
df1

   Hyd  Pune  Blore
a  0.0   1.0    2.0
b  6.0   7.0    8.0
d  NaN   NaN    NaN
c  3.0   4.0    5.0

In [47]:
city = ['Hyd','Pune','Mumbai']

In [48]:
df2 = df.reindex(columns=city)   # columns can be reindex with columns keyword

In [49]:
df2

   Hyd  Pune  Mumbai
a    0     1     NaN
c    3     4     NaN
b    6     7     NaN

In [50]:
df3= df.reindex(list('abdc'), columns=city)

In [51]:
df3

   Hyd  Pune  Mumbai
a  0.0   1.0     NaN
b  6.0   7.0     NaN
d  NaN   NaN     NaN
c  3.0   4.0     NaN

In [52]:
df

   Hyd  Pune  Blore
a    0     1      2
c    3     4      5
b    6     7      8

In [53]:
# we can do reindexing by label indexing i.e by loc
city = ['Hyd','Pune','Mumbai','Delhi']

df4 = df.loc[['a','d','b','c'],city]

df4

KeyError: 'Passing list-likes to .loc or [] with any missing labels is no longer supported, see https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike'

In [62]:
# Droping entries from Axis with DataFrame

df = pd.DataFrame(np.arange(16).reshape(4,4), index= list('abcd'), columns = ['Hyd','Pune','Blore','Kolkata'])


df

   Hyd  Pune  Blore  Kolkata
a    0     1      2        3
b    4     5      6        7
c    8     9     10       11
d   12    13     14       15

In [63]:
df.drop('c')    # dropping by index value

   Hyd  Pune  Blore  Kolkata
a    0     1      2        3
b    4     5      6        7
d   12    13     14       15

In [64]:
df.drop('Blore', axis =1)    # dropping by columns`

In [65]:
df

   Hyd  Pune  Kolkata
a    0     1        3
b    4     5        7
c    8     9       11
d   12    13       15

In [60]:
df.drop('Blore', axis =1, inplace = True)


df

   Hyd  Pune  Kolkata
a    0     1        3
b    4     5        7
c    8     9       11
d   12    13       15

In [66]:
# Indexing, Selection and Filtering with Dataframe


data = pd.DataFrame(np.arange(16).reshape(4,4), index = list('abcd'), columns = ['one','two','three','four'])

data

   one  two  three  four
a    0    1      2     3
b    4    5      6     7
c    8    9     10    11
d   12   13     14    15

In [67]:
data['two']     #indexing

a     1
b     5
c     9
d    13
Name: two, dtype: int32

In [68]:
data[:2]     #slicing

   one  two  three  four
a    0    1      2     3
b    4    5      6     7

In [69]:
data[data['three']>5]     # Filtering

   one  two  three  four
b    4    5      6     7
c    8    9     10    11
d   12   13     14    15

In [70]:
data <5     #Boolean DataFrame

     one    two  three   four
a   True   True   True   True
b   True  False  False  False
c  False  False  False  False
d  False  False  False  False

In [71]:
data[data<5] = 0     #assinging values with boolean 


data

   one  two  three  four
a    0    0      0     0
b    0    5      6     7
c    8    9     10    11
d   12   13     14    15

# Integer

In [72]:
ser = pd.Series(np.arange(4))

ser

0    0
1    1
2    2
3    3
dtype: int32

In [73]:
ser[1]

1

In [74]:
ser[:2]

0    0
1    1
dtype: int32

In [75]:
ser.loc[:2]

0    0
1    1
2    2
dtype: int32

In [76]:
ser.iloc[-1]

3

In [77]:
ser.iloc[-3:-1]

1    1
2    2
dtype: int32

In [78]:
ser2 = pd.Series(np.arange(4), index=list('abcd'))

ser2

a    0
b    1
c    2
d    3
dtype: int32

# arithmetic and Data Alignment

In [ ]:
# with Series

In [79]:
s1 = pd.Series(np.arange(3), index = list('abc'))
s2 = pd.Series(np.arange(5), index = ['a','c','e','f','g'])

In [80]:
s1

a    0
b    1
c    2
dtype: int32

In [81]:
s2

a    0
c    1
e    2
f    3
g    4
dtype: int32

In [82]:
s1+s2

a    0.0
b    NaN
c    3.0
e    NaN
f    NaN
g    NaN
dtype: float64

In [83]:
# with dataframe

In [84]:
df1 = pd.DataFrame(np.arange(9).reshape(3,3), columns = list('bcd'), index = ['one','two','three'])
df2 = pd.DataFrame(np.arange(12).reshape(4,3), columns = list('bde'), index = ['one','two','three','four'])

In [85]:
df1

       b  c  d
one    0  1  2
two    3  4  5
three  6  7  8

In [86]:
df2

       b   d   e
one    0   1   2
two    3   4   5
three  6   7   8
four   9  10  11

In [87]:
df1+df2

          b   c     d   e
four    NaN NaN   NaN NaN
one     0.0 NaN   3.0 NaN
three  12.0 NaN  15.0 NaN
two     6.0 NaN   9.0 NaN

In [88]:
df3 = pd.DataFrame({'A':[1,2]})
df4 = pd.DataFrame({'B':[3,4]})

In [89]:
df3

   A
0  1
1  2

In [90]:
df4

   B
0  3
1  4

In [91]:
df3+df4

    A   B
0 NaN NaN
1 NaN NaN

In [92]:
# Arithmetic method with fill value


df5 = pd.DataFrame(np.arange(12).reshape(3,4), columns = list('bcde'))
df6 = pd.DataFrame(np.arange(20).reshape(4,5), columns = list('bdefc'))

In [93]:
df5

   b  c   d   e
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [94]:
df6

    b   d   e   f   c
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [95]:
df6.loc[1,'b'] = np.nan
df6

      b   d   e   f   c
0   0.0   1   2   3   4
1   NaN   6   7   8   9
2  10.0  11  12  13  14
3  15.0  16  17  18  19

In [96]:
df5+df6

      b     c     d     e   f
0   0.0   5.0   3.0   5.0 NaN
1   NaN  14.0  12.0  14.0 NaN
2  18.0  23.0  21.0  23.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [97]:
df5.add(df6, fill_value=0)

      b     c     d     e     f
0   0.0   5.0   3.0   5.0   3.0
1   4.0  14.0  12.0  14.0   8.0
2  18.0  23.0  21.0  23.0  13.0
3  15.0  19.0  16.0  17.0  18.0

In [ ]:
#performing arithmetic operations on lists

dict={"MUM":10000 , "HYD":20000 , "BAN":12000, "JAM":13000}
ser1=pd.Series(dict)
ser1.name="list1"
ser1.index.name="cities"
print("Series 1\n",ser1)
list=["DEL", "MUM","UMB","CHD"]
ser2=pd.Series(dict,index=list)
ser2.name='list2' #give name to the series
ser2.index.name='cities'    #give name to the index of the series
print("series 2 is \n",ser2)

print("Series 1 + series2\n",ser1+ser2)
print("Series 1 * series2\n",ser1*ser2)


#reasigning the indexes to the series . THE NEW LIST SHOULD BE SAME IN SIZE AS SERIES INDEX SIZE 
ser1.index=["DEL","KOL", "CHE" , "GUJ"]
print(ser1)

# operation between dataframe and series

In [98]:
df6 = pd.DataFrame(np.arange(12).reshape(4,3), columns= ['a','b','c'], index = ['one','two','three','four'])

In [99]:
df6

       a   b   c
one    0   1   2
two    3   4   5
three  6   7   8
four   9  10  11

In [100]:
series = df6.iloc[0]    # complete one row value

In [101]:
series

a    0
b    1
c    2
Name: one, dtype: int32

In [102]:
df6-series   # broadcasting down the rows as index value matches

       a  b  c
one    0  0  0
two    3  3  3
three  6  6  6
four   9  9  9

In [104]:
series2 = pd.Series(range(3), index=['a','f','c'])  
# if index value of series and column value of dataframe didn't match, object will be reindexed to form union
series2

a    0
f    1
c    2
dtype: int64

In [105]:
df6+series2

         a   b     c   f
one    0.0 NaN   4.0 NaN
two    3.0 NaN   7.0 NaN
three  6.0 NaN  10.0 NaN
four   9.0 NaN  13.0 NaN

In [109]:
# Broadcasting over Column
df6

       a   b   c
one    0   1   2
two    3   4   5
three  6   7   8
four   9  10  11

In [106]:
series3 = df6['b']

In [107]:
series3

one       1
two       4
three     7
four     10
Name: b, dtype: int32

In [108]:
df6.sub(series3, axis=0)

       a  b  c
one   -1  0  1
two   -1  0  1
three -1  0  1
four  -1  0  1

# function application and mapping

In [110]:
df7 = pd.DataFrame(np.random.randn(4,3), columns=['b','d','e'], index = ['one','two','three','four'])

In [111]:
df7

              b         d         e
one   -1.312370 -0.918693  0.399047
two   -0.325260  0.595521  0.573559
three -0.712277 -0.110433  0.605941
four   1.229473  0.378199 -1.075307

In [112]:
# Absolute Function


np.abs(df7)

              b         d         e
one    1.312370  0.918693  0.399047
two    0.325260  0.595521  0.573559
three  0.712277  0.110433  0.605941
four   1.229473  0.378199  1.075307

In [ ]:
# applying function on one dimensional array to each columns or row

In [113]:
f= lambda x: x.max()-x.min()

df7.apply(f)

b    2.541844
d    1.514214
e    1.681248
dtype: float64

In [114]:
df7.apply(f, axis= 1)

one      1.711418
two      0.920780
three    1.318217
four     2.304780
dtype: float64

In [115]:
def f(x):
    return pd.Series([x.min(),x.max()], index = ['min','max'])
df7.apply(f)                                                      # Series with multiple values

            b         d         e
min -1.312370 -0.918693 -1.075307
max  1.229473  0.595521  0.605941

In [116]:
# Element wise Python function
d= lambda x: '%.2f'%x

In [117]:
df7.applymap(d) # cell level implementation

           b      d      e
one    -1.31  -0.92   0.40
two    -0.33   0.60   0.57
three  -0.71  -0.11   0.61
four    1.23   0.38  -1.08

In [118]:
df7['e'].map(d)

one       0.40
two       0.57
three     0.61
four     -1.08
Name: e, dtype: object

In [120]:
df7

              b         d         e
one   -1.312370 -0.918693  0.399047
two   -0.325260  0.595521  0.573559
three -0.712277 -0.110433  0.605941
four   1.229473  0.378199 -1.075307

In [119]:
def add_2(val):
    return val+2
df7.apply(add_2)

              b         d         e
one    0.687630  1.081307  2.399047
two    1.674740  2.595521  2.573559
three  1.287723  1.889567  2.605941
four   3.229473  2.378199  0.924693

# sorting and ranking

In [ ]:
# sorting series with index

In [121]:
obj = pd.Series( range(4), index=['b','d','a','c'])

In [122]:
obj

b    0
d    1
a    2
c    3
dtype: int64

In [123]:
obj.sort_index()

a    2
b    0
c    3
d    1
dtype: int64

In [ ]:
# sorting series with values

In [124]:
obj1 = pd.Series([4,-8,7,-1])

In [125]:
obj1.sort_values()

1   -8
3   -1
0    4
2    7
dtype: int64

In [126]:
obj2 = pd.Series([4,-8,7,np.nan,-1, np.nan])

In [127]:
obj2.sort_values()

1   -8.0
4   -1.0
0    4.0
2    7.0
3    NaN
5    NaN
dtype: float64

In [ ]:
# Ranking in series

In [128]:
obj3 = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [129]:
obj3.sort_values()

1   -5
5    0
4    2
3    4
6    4
0    7
2    7
dtype: int64

In [130]:
obj3.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [131]:
obj3.rank(method = 'first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [ ]:
# sorting dataframe with index

In [132]:
df8 = pd.DataFrame(np.arange(16).reshape(4,4), index = ['two','four','one','three'], columns = ['d','a','b','c'])


df8

        d   a   b   c
two     0   1   2   3
four    4   5   6   7
one     8   9  10  11
three  12  13  14  15

In [133]:
df8.sort_index()

        d   a   b   c
four    4   5   6   7
one     8   9  10  11
three  12  13  14  15
two     0   1   2   3

In [134]:
df8.sort_index(axis=1)

        a   b   c   d
two     1   2   3   0
four    5   6   7   4
one     9  10  11   8
three  13  14  15  12

In [ ]:
# sorting dataframe with values`

In [135]:
df9 = pd.DataFrame({'b':[4,3],'a':[-9,11]})


df9

   b   a
0  4  -9
1  3  11

In [136]:
df9.sort_values(by='a')

   b   a
0  4  -9
1  3  11

In [137]:
df9.sort_values(by=['a','b'])

   b   a
0  4  -9
1  3  11

In [138]:
df9.sort_values(by=['b','a'])

   b   a
1  3  11
0  4  -9

In [ ]:
# Ranking in Dataframe

In [139]:
data = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1], 'c': [-2, 5, 8, -2.5]})

In [140]:
data.rank(axis=1)

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [141]:
data.rank()

     b    a    c
0  3.0  1.5  2.0
1  4.0  3.5  3.0
2  1.0  1.5  4.0
3  2.0  3.5  1.0

In [142]:
data.rank(method='first', axis = 1)

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

# computing descriptive statistics

In [143]:
df = pd.DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]], index = ['a','b','c','d'], columns= ['one','two'])

In [144]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [145]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [146]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [147]:
df.mean(axis=1)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [148]:
df.idxmax()

one    b
two    d
dtype: object

In [149]:
df.idxmin()

one    d
two    b
dtype: object

In [150]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

# Membership

In [ ]:
# isin -- it performs a vectorize set membership check, useful in filtering a database down to a subject of values in a Series
# or columns in DataFrame

In [19]:
obj = pd.Series(['c','a','d','a','a','b','b','c','c'])
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [20]:
mask = obj.isin(['b','c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [21]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [22]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [23]:
data1 = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],'Qu2': [2, 3, 1, 2, 3],'Qu3': [1, 5, 2, 4, 4]})
data1

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [24]:
mask = data1.isin([3,2])
mask

     Qu1    Qu2    Qu3
0  False   True  False
1   True   True  False
2  False  False   True
3   True   True  False
4  False   True  False

In [25]:
data1[mask]

   Qu1  Qu2  Qu3
0  NaN  2.0  NaN
1  3.0  3.0  NaN
2  NaN  NaN  2.0
3  3.0  2.0  NaN
4  NaN  3.0  NaN

In [26]:
mask1 = data1.isin([4])

In [27]:
mask1

     Qu1    Qu2    Qu3
0  False  False  False
1  False  False  False
2   True  False  False
3  False  False   True
4   True  False   True

In [28]:
data1[mask1]

   Qu1  Qu2  Qu3
0  NaN  NaN  NaN
1  NaN  NaN  NaN
2  4.0  NaN  NaN
3  NaN  NaN  4.0
4  4.0  NaN  4.0

# Import Some Data

In [29]:
data=pd.read_csv("titanic_data_set.csv")
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

# See our Data

In [30]:
data.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [31]:
data.tail(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [32]:
print(data.columns)

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [33]:
data['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [34]:
data['Name'].count()

891

In [35]:
data['Sex'].count()

891

In [36]:
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [ ]:
data.iloc[0:10,0:3]